Интенсивное_обучение_программированию/src/Documents/ПроизводствоПродукции/ПроизводствоПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводствоПродукции</name>
  <comment>Производство продукции сотрудником</comment>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Интенсивное_обучение_программированию/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Интенсивное_обучение_программированию/src/Documents/ПроизводствоПродукции/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроизводствоПродукцииСписокТоваров.Товар КАК Номенклатура,
		|	СУММА(ПроизводствоПродукцииСписокТоваров.Количество) КАК Количество,
		|	ПроизводствоПродукцииСписокТоваров.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
		|ИЗ
		|	Документ.ПроизводствоПродукции.СписокТоваров КАК ПроизводствоПродукцииСписокТоваров
		|ГДЕ
		|	ПроизводствоПродукцииСписокТоваров.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПроизводствоПродукцииСписокТоваров.Товар,
		|	ПроизводствоПродукцииСписокТоваров.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроизводствоПродукцииСписокМатериалов.Материал,
		|	СУММА(ПроизводствоПродукцииСписокМатериалов.Количество),
		|	ПроизводствоПродукцииСписокМатериалов.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|ИЗ
		|	Документ.ПроизводствоПродукции.СписокМатериалов КАК ПроизводствоПродукцииСписокМатериалов
		|ГДЕ
		|	ПроизводствоПродукцииСписокМатериалов.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПроизводствоПродукцииСписокМатериалов.Материал,
		|	ПроизводствоПродукцииСписокМатериалов.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидДвижения";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
		Если РезультатЗапроса.Пустой() Тогда
			
			Возврат;
			
		КонецЕсли;
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);	
				
		КонецЦикла;
	
	Движения.ОстаткиНоменклатуры.Записать();
	Отказ = РегистрыНакопления.ОстаткиНоменклатуры.ПроверитьОтрицательныеОстаткиМатериала(ЭтотОбъект.Ссылка, ЭтотОбъект.Дата);
	
КонецПроцедуры

#КонецОбласти
